app/controllers/short_urls_controller.rb

SELECT * FROM `shortened_urls` WHERE (`shortened_urls`.`short_url` IS NULL) LIMIT 1
---
  def show
    @url = ShortenedUrl.find_by_short_url(params[:short_url])